// Напишите программу, которая будет выдавать название дня недели по заданному номеру.
// 3 -> Среда
// 5 -> Пятница

string[] daysOfWeek = { "Понедельник", "Вторник", "Среда", "Четверг", "Пятница", "Суббота", "Воскресенье" };

Console.WriteLine("Введите день недели: ");
int number = Convert.ToInt32(Console.ReadLine());
number = number - 1;

Console.WriteLine(daysOfWeek[number]);

